#+TITLE: Berezhnev's Emacs configuration
#+AUTHOR: Vladimir Berezhnev

#+BEGIN_SRC emacs-lisp
  ;; (server-mode)
  ;;(setq max-lisp-eval-depth 50000)
#+END_SRC

#+RESULTS:
: 50000

#+begin_src emacs-lisp :lexical no
  (if (and (fboundp 'native-comp-available-p)
         (native-comp-available-p))
    (message "Native compilation is available")
  (message "Native complation is *not* available"))
#+end_src

#+RESULTS:
: Native complation is *not* available

#+begin_src emacs-lisp :lexical no
  (if (functionp 'json-serialize)
    (message "Native JSON is available")
  (message "Native JSON is *not* available"))
#+end_src

#+RESULTS:
: Native JSON is available

** Theme changer
#+BEGIN_SRC emacs-lisp
  (use-package theme-changer
    :ensure nil
    :demand nil
    :straight (:host github :repo "hadronzoo/theme-changer" :branch "master")
    :config
    (setq calendar-location-name "Vladivostok, RU")
    (setq calendar-latitude 43.11)
    (setq calendar-longitude 131.88))

  ;;(change-theme 'tsdh-light 'doom-xcode)
  ;;(change-theme 'doom-one-light 'doom-outrun-electric)
  (load-theme 'doom-one-light)
#+END_SRC

#+RESULTS:
: [nil 26501 38645 0 nil change-theme (tsdh-light doom-xcode doom-xcode) nil 0 nil]

** Blur
#+BEGIN_SRC emacs-lisp
  ;; (set-frame-parameter (selected-frame) 'alpha-background 70)
  ;; (add-to-list 'default-frame-alist '(alpha-background . 70))

  (set-frame-parameter (selected-frame) 'alpha '(98 . 98))
  (add-to-list 'default-frame-alist '(alpha . (98 . 98)))
#+END_SRC

#+RESULTS:
: ((alpha-background . 70) (font . Iosevka 12) (ns-transparent-titlebar . t) (horizontal-scroll-bars) (alpha 98 . 98) (vertical-scroll-bars))

** RSS

Probably the best available RSS client for Emacs is elfeed. It allows
asynchronious sync, automatical refresh by using internal timers, and more.
It provides a user-interface decoupled from the backend logic so we have an
opportunity to implement our own views.

#+BEGIN_SRC example
(use-package elfeed
  :if workstation-p
  :ensure t
  :commands (elfeed)
  :config
  (setq-default elfeed-search-filter ""))
#+END_SRC

Managing our RSS feeds in org file is much more cool than having them in
a list of lists.

#+BEGIN_SRC example
(use-package elfeed-org
  :if workstation-p
  :ensure t
  :config
  (elfeed-org))
#+END_SRC

#+BEGIN_SRC example
(setq rmh-elfeed-org-files (list "~/.emacs.d/elfeed.org"))
#+END_SRC

#+RESULTS:
| ~/.emacs.d/elfeed.org |

We have so many feeds subscribed and not enough time to read them
all. By default show only the work-related articles.

#+BEGIN_SRC example
(setq elfeed-search-filter "+work")
#+END_SRC

Automatically fetch updates from RSS feeds. Let's do it every day, but I am
afraid, that it will lag the whole Emacs, so we will probably need to adjust it
and run less frequently.

See:
- https://github.com/skeeto/elfeed/issues/304
- https://www.reddit.com/r/emacs/comments/bvbp92/is_there_a_simple_way_to_get_elfeed_to_update/

#+BEGIN_SRC example
(setq my/elfeed-update-timer
  (run-at-time nil (* 1 60 60 24) #'elfeed-update))
#+END_SRC

Use ~M-x helm-timers~ to see (and cancel) executed timers.

Very likely we will need to execute operation accross every displayed article

See https://emacs.stackexchange.com/a/2441

#+BEGIN_SRC example
(defun elfeed-apply-for-all (f)
  (interactive)
  (mark-whole-buffer)
  (f))
#+END_SRC

Such as marking everything as read

#+BEGIN_SRC example
(defun elfeed-mark-all-as-read ()
  (elfeed-apply-for-all elfeed-search-untag-all-unread))
#+END_SRC

You will probably find these keybindings useful.

| Key binding | Explanation                   |
|-------------+-------------------------------|
| RET         | Open article in elfeed        |
| o           | Open article in a web browser |
| r           | Fetch new articles            |
| u           | Mark article as read          |
| U           | Mark article as unread        |
| +           | Add tag                       |
| -           | Remove tag                    |
| S           | Stop all fetching processes   |

Define custom key bindings for the list of articles

#+BEGIN_SRC example
(with-eval-after-load "elfeed-search"
  (evil-define-key*
    'normal elfeed-search-mode-map
    "RET" #'elfeed-search-show-entry
    "o" #'elfeed-search-browse-url
    "r" #'elfeed-search-fetch
    "S" #'elfeed-unjam))
#+END_SRC

Define custom key bindings for when reading an article

#+BEGIN_SRC example
(with-eval-after-load "elfeed-show"
  (evil-define-key*
    'motion elfeed-show-mode-map
    "gb" #'elfeed-show-visit
    "gj" #'elfeed-show-next
    "gk" #'elfeed-show-prev))
#+END_SRC

Finally, customize colors

#+BEGIN_SRC example
(set-face-attribute
 'elfeed-search-date-face nil
 :foreground my/blue)

(set-face-attribute
 'elfeed-search-title-face nil
 :foreground "#d0d0d0") ;; Normal text foreground, we should define it somewhere

(set-face-attribute
 'elfeed-search-feed-face nil
 :foreground my/blue)

(set-face-attribute
 'elfeed-search-tag-face nil
 :foreground my/green)

(set-face-attribute
 'elfeed-search-unread-title-face nil
 :foreground my/purple
 :weight 'normal
 :width 'normal)
#+END_SRC

Don't show any date, we don't have enough space for that

#+BEGIN_SRC emacs-lisp
(defun elfeed-search-format-date (date)
  "")
#+END_SRC

We also need a less space for article authors in favor of their
titles.

#+BEGIN_SRC emacs-lisp
(setq elfeed-search-trailing-width 15)
#+END_SRC

I want to customize the columns order but ~elfeed~ doesn't support such thing
yet. We need to re-implement the whole displaying function.

#+BEGIN_SRC emacs-lisp
(setq elfeed-search-print-entry-function #'frostyx/elfeed-search-print-entry)

(defun frostyx/elfeed-search-print-entry (entry)
  "Print ENTRY to the buffer."
  (let* ((date (elfeed-search-format-date (elfeed-entry-date entry)))
         (title (or (elfeed-meta entry :title) (elfeed-entry-title entry) ""))
         (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
         (feed (elfeed-entry-feed entry))
         (feed-title
          (when feed
            (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
         (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
         (tags-str (mapconcat
                    (lambda (s) (propertize s 'face 'elfeed-search-tag-face))
                    tags ","))
         (title-width (- (window-width) 10 elfeed-search-trailing-width))
         (title-column (elfeed-format-column
                        title (elfeed-clamp
                               elfeed-search-title-min-width
                               title-width
                               elfeed-search-title-max-width)
                        :left)))
    (insert (propertize date 'face 'elfeed-search-date-face) " ")
    ;; The whole function is copy-pasted `elfeed-search-print-entry--default',
    ;; just the following lines are changed
    (when feed-title
      (insert (string-pad
               (propertize feed-title 'face 'elfeed-search-feed-face) 15)))
    (insert (propertize title-column 'face title-faces 'kbd-help title) " ")
    (when tags
      (insert "(" tags-str ")"))))
#+END_SRC
** Desktop notifications

See https://github.com/sinic/ednc

The package is in MELPA but I am installing from my fork because of a
custom changes.

See https://github.com/sinic/ednc/pull/12

#+BEGIN_SRC emacs-lisp
(use-package ednc
  :quelpa (ednc
           :fetcher github
           :repo "FrostyX/ednc"
           :branch "ednc-faces")
  :config
  (ednc-mode 1))
#+END_SRC

Use pretty colors

#+BEGIN_SRC emacs-lisp
(set-face-attribute 'ednc-app-name nil :foreground my/blue)
(set-face-attribute 'ednc-title nil :foreground my/green)
(set-face-attribute 'ednc-body nil :foreground my/yellow)
#+END_SRC

Setup some basic key bindings

#+BEGIN_SRC emacs-lisp
(general-nmap
  :keymaps 'ednc-view-mode-map
  "TAB" 'ednc-toggle-expanded-view)
#+END_SRC

For debugging, you can send a notification from Emacs like this

#+BEGIN_src example
(notifications-notify
 :app-name "EDNC"
 :title "1st test"
 :body "hello, world"
 :urgency "normal")
#+END_src

#+RESULTS:
: 2

I don't know how exactly the Linux notification system works but it
seems there cannot be multiple daemons listening at the same time. If
you don't see any notifications, check whether the daemon runs in
another Emacs instance, or whether another daemon is running (Dunst,
Qtile widget, etc).

I want the log buffer to automatically scroll down, similarly like
~tail -f~ works.

See https://stackoverflow.com/a/12666854/3285282

#+BEGIN_SRC emacs-lisp
(defun frostyx/autoscroll ()
  (set (make-local-variable 'window-point-insertion-type) t))

(add-hook 'ednc-view-mode-hook 'frostyx/autoscroll)
#+END_SRC
** Modeline
:PROPERTIES:
:ORDERED:  t
:END:
:LOGBOOK:
CLOCK: [2024-11-14 Чт 15:06]--[2024-11-14 Чт 15:06] =>  0:00
CLOCK: [2024-11-14 Чт 15:05]--[2024-11-14 Чт 15:05] =>  0:00
CLOCK: [2024-11-14 Чт 15:05]--[2024-11-14 Чт 15:05] =>  0:00
CLOCK: [2024-11-14 Чт 14:44]--[2024-11-14 Чт 15:02] =>  0:18
CLOCK: [2024-11-14 Чт 14:44]--[2024-11-14 Чт 14:44] =>  0:00
CLOCK: [2024-10-21 Пн 18:21]--[2024-10-21 Пн 18:21] =>  0:00
CLOCK: [2024-08-09 Пт 01:05]--[2024-08-09 Пт 01:05] =>  0:00
CLOCK: [2024-08-09 Пт 01:04]--[2024-08-09 Пт 01:04] =>  0:00
CLOCK: [2024-08-09 Пт 01:03]--[2024-08-09 Пт 01:03] =>  0:00
CLOCK: [2024-08-09 Пт 01:02]--[2024-08-09 Пт 01:02] =>  0:00
CLOCK: [2024-08-09 Пт 01:02]--[2024-08-09 Пт 01:02] =>  0:00
:END:

See https://dev.to/gonsie/beautifying-the-mode-line-3k10

#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode 1))
#+END_SRC

Some basic modeline customizations

#+BEGIN_SRC emacs-lisp
;; Make it smaller
(setq doom-modeline-height 22)

;; By default the icons are larger than the rest of the text, we don't want that
(setq all-the-icons-scale-factor 1.0)

;; Don't show icons, I have some bug rendering them incorrectly
(setq doom-modeline-icon nil)

;; Display only buffer names, not full paths
(setq doom-modeline-buffer-file-name-style 'buffer-name)

;; Don't show buffer encoding
(setq doom-modeline-buffer-encoding nil)

;; Don't show any mess next to major-mode
(setq doom-modeline-env-version nil)
#+END_SRC

#+RESULTS:

General modeline (non doom-modeline specific) settings

#+BEGIN_SRC example
(set-face-attribute
 'mode-line nil
 :background my/gray)

(set-face-attribute
 'mode-line-inactive nil
 :foreground my/lgray
 :background my/gray)
#+END_SRC

#+RESULTS:

No bold or italic texts and other font configurations

#+BEGIN_SRC example
(set-face-attribute
 'doom-modeline-emphasis nil
 :weight 'normal
 :slant 'normal)

(set-face-attribute
 'doom-modeline-bar nil)

(set-face-attribute
 'doom-modeline-buffer-file nil
 :weight 'normal)

(set-face-attribute
 'doom-modeline-buffer-modified nil
 :weight 'normal)

(set-face-attribute
 'doom-modeline-buffer-major-mode nil
 :foreground my/orange)
#+END_SRC

Configure fonts for the evil segment

#+BEGIN_SRC example
(set-face-attribute
 'doom-modeline-evil-normal-state nil
 :background my/gray
 :foreground my/orange)

(set-face-attribute
 'doom-modeline-evil-emacs-state nil
 :background my/gray
 :foreground my/blue)

(set-face-attribute
 'doom-modeline-evil-insert-state nil
 :background my/gray
 :foreground my/green)

(set-face-attribute
 'doom-modeline-evil-replace-state nil
 :background my/gray
 :foreground my/blue)

(set-face-attribute
 'doom-modeline-evil-motion-state nil
 :background my/gray
 :foreground my/blue)

(set-face-attribute
 'doom-modeline-evil-visual-state nil
 :background my/gray
 :foreground my/purple)
#+END_SRC

#+RESULTS:

#+RESULTS:
: doom-modeline--frostyx-org-agenda-update

#+begin_src emacs-lisp :lexical no
  (use-package nerd-icons
    :ensure)
#+end_src

#+RESULTS:

Custom segments will be defined further down in this config file. In
order to not fail with undefined variable errors, let's just
mock-define them for now.

Segments in the modeline can be placed into 3 separate groups - left,
middle, and right. The left group is somewhat non-customizable, here
comes the configuration of the middle

#+begin_src example :lexical no
    (defvar frostyx-org-agenda-count "")

(defun frostyx-org-agenda-count-update ()
  "Update the count of tasks marked as NEXT and IN-PROGRESS from the org file."
  (let ((next-count 0)
        (in-progress-count 0)
        (org-file "~/Org/agenda/GTD/org-gtd-tasks.org"))
    (when (file-exists-p org-file)
      (with-current-buffer (find-file-noselect org-file)
        (org-eldoom-modeline-def-modeline 'main
            frostyx/doom-modeline-middle-segments
            frostyx/doom-modeline-right-segments)
#+END_SRC

#+RESULTS:
: doom-modeline-format--main

Define modeline for helm

#+BEGIN_SRC example
  (doom-modeline-def-modeline 'helm
    '(helm-buffer-id helm-number helm-follow helm-prefix-argument)
    '(helm-help time))
#+END_SRC

Don't use any pre-defined modelines for various major modes. We will
define our own later, though.

#+BEGIN_SRC emacs-lisp
(setq doom-modeline-mode-alist '())
#+END_SRC
** Olivetti
#+BEGIN_SRC emacs-lisp
  (use-package olivetti
    :ensure t
    :defer t
    :hook ((text-mode         . olivetti-mode)
           ;; (org-agenda-mode   . olivetti-mode)
           (prog-mode         . olivetti-mode)
           (Info-mode         . olivetti-mode)
           (org-mode          . olivetti-mode)
           (nov-mode          . olivetti-mode)
           (markdown-mode     . olivetti-mode)
           (mu4e-view-mode    . olivetti-mode)
           (elfeed-show-mode  . olivetti-mode))
    :config
    (setq olivetti-body-width 150))
#+END_SRC

#+RESULTS:
| olivetti-mode |

** Completion (Company)

Our completion framework of choice is ~company~.

See https://company-mode.github.io/

#+BEGIN_SRC emacs-lisp
    (use-package company
      :ensure t
      :hook
      (company-mode . frostyx/company-mode-hook)
      :config
  ;; Company mode
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 1)

  ;; Go - lsp-mode
  ;; Set up before-save hooks to format buffer and add/delete imports.
  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks)

  ;; Start LSP Mode and YASnippet mode
  (add-hook 'go-mode-hook #'lsp-deferred)
  (add-hook 'go-mode-hook #'yas-minor-mode))
#+END_SRC

#+RESULTS:
| company-mode-set-explicitly | company-box-mode | frostyx/company-mode-hook |

When ~company-mode~ is activated for a buffer, use do some
configuration, such as, changing ~C-n~ to use it. Also automatically
insert candidates while ~C-n~ and ~C-p~ through them.

#+BEGIN_SRC emacs-lisp
(defun frostyx/company-mode-hook ()
  (setq-local evil-complete-next-func 'frostyx/company-complete))
#+END_SRC

Unfortunatelly we cannot use the default ~company-complete~ because it
takes no arguments.

#+BEGIN_SRC emacs-lisp
(defun frostyx/company-complete (&optional arg)
  (interactive)
  (company-complete-common-or-cycle))
#+END_SRC

For the love of god, be case-sensitive. This setting IMHO applies only
to plain text completions.

#+BEGIN_SRC emacs-lisp
(setq company-dabbrev-ignore-case nil)
(setq company-dabbrev-downcase nil)
#+END_SRC

Make the icons less disruptive and cooler

#+BEGIN_SRC emacs-lisp
(setq company-icon-margin 3)
#+END_SRC

Automatically insert candidates while ~C-n~ and ~C-p~ through them.

#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook 'company-tng-mode)
#+END_SRC

We need to turn off the auto configuration because it messes up with
brackets. But now we need to remap the ~company-active-map~ manually
otherwise pressing ~RET~ without selecting a candiate does nothing
(instead of simply inserting a new line)

#+BEGIN_SRC emacs-lisp
(setq company-tng-auto-configure nil)
(with-eval-after-load 'company-tng
  (setq company-active-map company-tng-map))
#+END_SRC

Use ~company-mode~ everywhere

#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook 'global-company-mode)
#+END_SRC

Use ~company-box~ it automatically shows documentation

#+BEGIN_SRC emacs-lisp
(use-package company-box
  :ensure t
  :hook
  (company-mode . company-box-mode)

  :config
  (setq company-box-icon-right-margin 1))
#+END_SRC

Make ~company-box-mode~ play well with ~company-tng-mode~.
See https://github.com/sebastiencs/company-box/issues/47

#+BEGIN_SRC emacs-lisp
(setq company-frontends '(company-tng-frontend company-box-frontend))
#+END_SRC

*** Company for org-mode
#+begin_src emacs-lisp
  (use-package company-org-block
    :ensure t
    :defer t
    :custom
    (company-org-block-edit-style 'auto) ;; 'auto, 'prompt, or 'inline
    :hook ((org-mode . (lambda ()
                         (setq-local company-backends '(company-org-block))
                         (company-mode +1)))))
#+end_src

#+RESULTS:
| (lambda nil (setq-local company-backends '(company-org-block)) (company-mode 1)) | toc-org-mode | org-appear-mode | org-modern-mode | ma/org-buffer-setup | org-tempo-setup | olivetti-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

**** Initional variables
#+begin_src emacs-lisp 
  (setq
   org-ellipsis " ⤵" ;; ⤵, ᗐ, ↴, ▼, ▶, ⤵, ▾
   org-roam-v2-ack t                 ; anonying startup message
   ;; org-log-done 'time                ; I need to know when a task is done
   org-hide-leading-stars t
   org-log-into-drawer t
   org-startup-folded t
   ;; org-odd-levels-only t
   org-pretty-entities t
   org-startup-indented t
   org-adapt-indentation t
   org-hide-macro-markers t
   org-hide-block-startup nil
   ;; org-src-fontify-natively t
   org-src-tab-acts-natively t
   org-cycle-separator-lines 2
   org-startup-with-inline-images t
   org-display-remote-inline-images t
   org-src-preserve-indentation nil
   org-edit-src-content-indentation 2
   ;; org-fontify-quote-and-verse-blocks t
   org-export-with-smart-quotes t

   org-checkbox-hierarchical-statistics nil
   org-read-date-prefer-future 'time
   org-agenda-todo-ignore-scheduled 'future
   org-agenda-tags-todo-honor-ignore-options t
   org-agenda-todo-ignore-with-date t
   org-image-actual-width '(300)
   org-log-done (quote time)
   ;; Don't log the time a task was rescheduled or redeadlined.
   org-log-redeadline t ; changed
   org-log-reschedule t)
   org-todo-keyword-faces
   ;; '(
   ;;   ("TODO" :background "indian red" :foreground "white" :weight bold)
   ;;   ("NEXT" :background "sky blue" :foreground "black" :weight bold)
   ;;   ("WAIT" :background "olive drab" :foreground "black" :weight bold)
   ;;   ("DONE" :background "pale green" :foreground "black" :weight bold)
   ;;   ("CNCL" :background "dark red" :foreground "white" :weight bold))
  ;; org-todo-keywords
  ;; '((sequence "NEXT(n)" "TODO(t)" "WAIT(w)" "|" "DONE(d)" "CNCL(c)")) ; changed

  ;; ("DOING" :background "tomato" :foreground "white" :weight bold)
  ;; ("STOPPED" :background "firebrick2" :foreground "white" :weight bold)
  ;; ("REVIEW" :background "cyan" :foreground "black" :weight bold)
  ;; ("ARCHIVED" :background "light slate blue" :foreground "white" :weight bold)
  ;; (setq )

  ;; (setq )

  ;; (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
  (with-eval-after-load 'org
    (setq org-confirm-babel-evaluate nil)
    (require 'org-tempo)

    (add-hook 'org-babel-after-execute-hook (lambda ()
                                              (when org-inline-image-overlays
                                                (org-redisplay-inline-images))))
    (add-to-list 'org-modules 'org-tempo t))
#+end_src

#+RESULTS:
| org-habit | ol-doi | ol-w3m | ol-bbdb | ol-bibtex | ol-docview | ol-gnus | ol-info | ol-irc | ol-mhe | ol-rmail | ol-eww | org-tempo |

**** Org-agenda
:LOGBOOK:
CLOCK: [2024-11-14 Чт 15:29]--[2024-11-14 Чт 15:29] =>  0:00
CLOCK: [2024-11-14 Чт 15:12]--[2024-11-14 Чт 15:23] =>  0:11
CLOCK: [2024-11-14 Чт 15:12]--[2024-11-14 Чт 15:12] =>  0:00
CLOCK: [2024-11-14 Чт 15:12]--[2024-11-14 Чт 15:12] =>  0:00
CLOCK: [2024-11-14 Чт 15:11]--[2024-11-14 Чт 15:11] =>  0:00
:END:
#+begin_src emacs-lisp :lexical no
  (evil-leader/set-key
          "z" '(org-agenda nil "z")
          "qs" 'hq-shop
          "qb" 'hq-buy-item
          "qu" 'hq-use-item)

  (global-set-key (kbd "C-c C-x o") 'org-clock-out)
  (global-set-key (kbd "C-c C-x j") 'org-clock-go-to)
#+end_src

#+RESULTS:
: org-clock-go-to

#+begin_src emacs-lisp 
  (use-package org-agenda
    :ensure nil
    :straight (:type built-in)
    :bind
    (:map global-map
          ("C-c a" . org-agenda))
    :config
    (setq org-agenda-start-on-weekday 0
          org-agenda-skip-scheduled-if-done t ; changed
          org-agenda-skip-deadline-if-done t ; changed
          org-agenda-include-deadlines t
          org-agenda-block-separator #x2501
          org-agenda-compact-blocks t ; changed
          org-agenda-start-with-log-mode nil
         	org-agenda-deadline-faces
          '((1.0001 . org-warning)              ; due yesterday or before
            (0.0    . org-upcoming-deadline))   ; due today or later
         	org-icalendar-combined-name "Hugo Org"
         	org-icalendar-use-scheduled '(todo-start event-if-todo event-if-not-todo)
         	org-icalendar-use-deadline '(todo-due event-if-todo event-if-not-todo)
         	org-icalendar-timezone "Asia/Vladivostok"
         	org-icalendar-store-UID t
         	org-icalendar-alarm-time 30
         	calendar-date-style 'european
         	calendar-week-start-day 0
          calendar-mark-holidays-flag t
          calendar-mark-diary-entries-flag nil
       		;; (setq-default org-icalendar-include-todo t)
         	org-agenda-breadcrumbs-separator " ❱ "
          org-agenda-current-time-string "⏰ ┈┈┈┈┈┈┈┈┈┈┈ now"
          org-agenda-time-grid '((today require-timed remove-match)
                                 (500 800 1000 1200 1400 1600 1800 2000)
                                 ":  " "┈┈┈┈┈┈┈┈┈┈┈┈┈")
          org-agenda-prefix-format
       		'((agenda . "%-10c | %?-12t% s")
       			(todo . "%-10s")
       			(tags . "%t %-10c | %s")
       			(search . "%c %t %s"))
          org-agenda-clockreport-parameter-plist
          (quote (:maxlevel 5 :compact t :wstart 0 :link nil :formula % :tags nil :properties ("CATEGORY" "EFFORT" "File") :narrow 80 :fileskip0 t))
          org-agenda-scheduled-leaders '("[S]:" "[S] x%3dd.:")
          org-agenda-deadline-leaders '("[D]:" "[D] +%3dd.:" "[D] -%3dd.:")
         	org-agenda-format-date (lambda (date) (concat "\n" (make-string (window-width) 9472)
                                                        "\n"
                                                        (org-agenda-format-date-aligned date)))
         	org-default-notes-file "~/Org/agenda/Notes.org"
         	org-agenda-files '("~/Org/agenda/GTD/org-gtd-tasks.org")) ;; "~/Org/agenda/Calendar.org"

    (setq mixed-pitch-fixed-pitch-faces
     			(quote (line-number-current-line line-number font-lock-comment-face org-done org-todo org-todo-keyword-outd org-todo-keyword-kill org-todo-keyword-wait org-todo-keyword-done org-todo-keyword-habt org-todo-keyword-todo org-tag org-ref-cite-face org-property-value org-special-keyword org-date diff-added org-drawer diff-context diff-file-header diff-function diff-header diff-hunk-header diff-removed font-latex-math-face font-latex-sedate-face font-latex-warning-face font-latex-sectioning-5-face font-lock-builtin-face font-lock-comment-delimiter-face font-lock-constant-face font-lock-doc-face font-lock-function-name-face font-lock-keyword-face font-lock-negation-char-face font-lock-preprocessor-face font-lock-regexp-grouping-backslash font-lock-regexp-grouping-construct font-lock-string-face font-lock-type-face font-lock-variable-name-face markdown-code-face markdown-gfm-checkbox-face markdown-inline-code-face markdown-language-info-face markdown-language-keyword-face markdown-math-face message-header-name message-header-to message-header-cc message-header-newsgroups message-header-xheader message-header-subject message-header-other mu4e-header-key-face mu4e-header-value-face mu4e-link-face mu4e-contact-face mu4e-compose-separator-face mu4e-compose-header-face org-block org-block-begin-line org-block-end-line org-document-info-keyword org-code org-indent org-latex-and-related org-checkbox org-formula org-meta-line org-table org-verbatim)))

    ;; Hide duplicates of the same todo item
    ;; If it has more than one of timestamp, scheduled,
    ;; or deadline information
    (setq org-agenda-skip-timestamp-if-done t
     			org-agenda-skip-deadline-if-done t
     			org-agenda-skip-scheduled-if-done t
     			org-agenda-skip-scheduled-if-deadline-is-shown t
     			org-agenda-skip-timestamp-if-deadline-is-shown t)

    ;; (setq org-agenda-clockreport-parameter-plist
    ;;       (quote (:link t :maxlevel 5 :fileskip t :compact t :narrow 80)))

    (defun my/style-org-agenda()
      (set-face-attribute 'org-agenda-date nil :height 1.3)
      (set-face-attribute 'org-agenda-date-today nil :height 1.3 :slant 'italic)
      (set-face-attribute 'org-agenda-date-weekend nil :height 1.3))
    (add-hook 'org-agenda-mode-hook 'my/style-org-agenda)

    (setq org-agenda-custom-commands
          '(("c" "Getting Things Done (GTD)"
             ((agenda "" ((org-agenda-span 'day)
   												(org-agenda-skip-scheduled-if-done nil)
   												(org-agenda-skip-deadline-if-done nil)
   												(org-agenda-clockreport-mode t)
   												(org-agenda-remove-tags t)
   												(org-agenda-sorting-strategy '(habit-down time-up priority-down category-keep user-defined-up))
   												(org-time-budgets-in-agenda-maybe)
   												(org-agenda-include-deadlines t)

   												(org-agenda-files '("~/Org/agenda/PlanAhead.org" "~/Org/agenda/GTD/org-gtd-tasks.org"))
   												(org-super-agenda-groups
   												 '((:name "Schedule"
         														:time-grid t)
   													 (:name "Today"
         														:scheduled today
         														:face (:background "medium sea green" :foreground "white")
   																	:face 'warning)
   													 (:name "Future deadline"
         														:deadline future
         														:face (:background "deep sky blue"))
   													 (:name "Deadline today"
         														:deadline today
         														:face (:background "black" :foreground "white"))
   													 (:name "Passed deadline"
         														:deadline past
   																	:scheduled past
         														:face (:background "salmon"))))))

   						(tags "CLOSED>=\"<today>\""
   									((org-agenda-overriding-header "\nCompleted today\n")))
              
              (gtd-add-progress-info-to-agenda "")))
            
            ("x" "Habits view"
             ((agenda "" ((org-agenda-span 'day)
                          (org-habit-show-habits t)
                          (org-agenda-remove-tags t)
                          (org-agenda-prefix-format "  ∘ %t %s")
                          (org-agenda-files '("~/Org/agenda/GTD/org-gtd-tasks.org"))
                          (org-agenda-finalize-hook '(hq-add-quest-info-to-agenda))
                          (org-super-agenda-groups
                           '((:name "Everytime"
         														:tag ("everytime"))
         										 (:name "Morning"
         													  :tag ("morning"))
         										 (:name "Day"
         													  :tag ("day"))
         										 (:name "Evening"
         													  :tag ("evening"))
         										 ;; (:name "Challenges"
         										 ;;  			:tag "challenge")
         										 (:discard (:anything))
         										 (:discard (:not (:tag "habit")))))))
              (hq-add-quest-info-to-agenda "")))
            
            ("p" "Private counter"
             ((agenda "" ((org-agenda-span 'day)
                          (org-habit-show-habits t)
                          (org-agenda-remove-tags t)
                          (org-agenda-prefix-format "  ∘ %t %s")
                          (org-agenda-files '("~/Org/agenda/GTD/org-gtd-tasks.org"))
                          (org-super-agenda-groups
                           '((:name "===== Other ====="
         												    :tag "other"
                                    :face (:background "red" :foreground "white" :weight "bold"))
         										 (:discard (:anything))
         										 (:discard (:not (:tag "habit")))))))))

     				;; ("k" "Time Tracking Overview"
            ;;  my/time-tracking-view)

            ("d" "Day results"
             ((agenda ""
                      ((org-agenda-span 'day)
   										 (org-agenda-overriding-header "\n === TIME REPORT ===")
   										 (org-agenda-skip-scheduled-if-done nil)
   										 (org-log-done 'time)
   										 (org-log-into-drawer nil)
   										 (org-agenda-skip-deadline-if-done nil)
   										 ;;(org-agenda-block-separator nil)
   										 (org-agenda-clockreport-mode t)
   										 (org-agenda-remove-tags t)
   										 (org-agenda-sorting-strategy '(habit-down time-up priority-down category-keep user-defined-up))
   										 (org-time-budgets-in-agenda-maybe)
   										 (org-agenda-include-deadlines t)
   										 (org-agenda-clockreport-parameter-plist
   											'(:scope ("~/Org/agenda/GTD/org-gtd-tasks.org"
   																"~/Org/agenda/GTD/gtd_archive_2025"
   																"~/Org/agenda/GTD/gtd_archive_2024"
   																"~/Org/agenda/GTD/org-gtd-tasks.org_archive")
   															 :maxlevel 5
   															 :emphasize t
   															 :block day
   															 :compact t
   															 :wstart 0
   															 :link nil
   															 :formula %
   															 :tags nil
  															 :hidefiles t
   															 :properties ("CATEGORY" "EFFORT")))
   										 (org-agenda-files '("~/Org/agenda/GTD/org-gtd-tasks.org"
   																				 "~/Org/agenda/GTD/gtd_archive_2025"
   																				 "~/Org/agenda/GTD/gtd_archive_2024"
   																				 "~/Org/agenda/GTD/org-gtd-tasks.org_archive"))
   										 (org-super-agenda-groups '((:discard (:anything))))))
   						(my/time-tracking-view "")
   						(tags "CLOSED>=\"<today>\""
   									((org-agenda-overriding-header "\n === COMPLETED TASKS ===")
   									 (org-agenda-remove-tags t)))))))

    (add-hook 'org-agenda-mode-hook 'org-super-agenda-mode))
#+end_src

#+RESULTS:
: org-agenda

**** Org-habit
#+begin_src emacs-lisp
  (use-package org-habit
    :after org
    :ensure nil
    :straight (:type built-in)
    :init
    ;;(add-to-list 'org-modules 'org-habit)
    (progn
      (custom-set-faces
       '(org-habit-clear-face
         ((t (:background "pale green"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))

       '(org-habit-clear-future-face
         ((t (:background "gray"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       '(org-habit-alert-future-face
         ((t (:background "light coral"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       '(org-habit-alert-face
         ((t (:background "light coral"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       '(org-habit-overdue-face
         ((t (:background "light coral"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       '(org-habit-overdue-future-face
         ((t (:background "gray"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       '(org-habit-ready-face
         ((t (:background "pale green"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       '(org-habit-ready-future-face
         ((t (:background "gray"
          								:foreground "white"
          								:width expanded
          								:height 1.0
          								:box (:line-width (1 . 1) :color "white")))))
       ))
    :config
    (load "~/.emacs.d/lisp/my-org-habit")
    (setq org-habit-following-days 1
          org-habit-preceding-days 9
          org-habit-show-habits nil
          org-habit-show-all-today t
          org-habit-graph-column 60
          org-habit-overdue-glyph ?○
          org-habit-alert-glyph ?○
          org-habit-ready-future-glyph ?○ ;;⬡
          org-habit-today-glyph ?◎
          org-habit-completed-glyph ?●
          org-habit-show-done-always-green t)

    (defun toggle-org-habit-show-all-today ()
      "Toggle the value of `org-habit-show-all-today' between t and nil."
      (interactive)
      (setq org-habit-show-all-today (not org-habit-show-all-today))
      (message "org-habit-show-all-today is now %s"
          		 (if org-habit-show-all-today "nil" "t"))
      (org-agenda-refresh))

    (define-key org-agenda-mode-map (kbd "<f12>") 'toggle-org-habit-show-all-today))

  (use-package org-habit-stats
    :ensure t
    :config
    (add-hook 'org-after-todo-state-change-hook 'org-habit-stats-update-properties)
    (add-hook 'org-agenda-mode-hook
          		(lambda () (define-key org-agenda-mode-map "Z" 'org-habit-stats-view-next-habit-in-agenda))))

(defun org-habit-count-last-streak (state-str)
  "Подсчитывает количество последних подряд идущих ● в строке состояния."
  (let ((streak 0))
    (cl-loop for i from (1- (length state-str)) downto 0
             while (= (aref state-str i) ?●)
             do (setq streak (1+ streak)))
    streak))

(defun org-habit-streak-count ()
  "Подсчитывает и отображает текущий стрик для каждой привычки в org-agenda."
  (goto-char (point-min))
  (while (not (eobp))
    (when (get-text-property (point) 'org-habit-p)
      (let ((streak 0))
        ;; Ищем строку состояния привычки (○●◎)
        (save-excursion
          (when (re-search-forward "\\([○●◎]\\)+" (line-end-position) t)
            (let ((state-str (match-string 0)))
              ;; Если последний символ ●, считаем стрик
              (when (= (aref state-str (1- (length state-str))) ?●)
                (setq streak (org-habit-count-last-streak state-str))))))
        
        (end-of-line)
        (insert (format " [🔥 %d]" streak))))
    (forward-line 1)))

(add-hook 'org-agenda-finalize-hook 'org-habit-streak-count)
#+end_src

#+RESULTS:
| org-habit-streak-count |

***** Org roam bibtex 
#+begin_src emacs-lisp :lexical no :async
  (use-package org-roam-bibtex
    :after org-roam
  	:quelpa (org-roam-bibtex
         :fetcher github
         :repo "org-roam/org-roam-bibtex"
         :branch "main"))
    ;;:config
    ;;(require 'org-ref) ; optional: if using Org-ref v2 or v3 citation links
#+end_src

#+begin_src emacs-lisp :lexical no
  (defun my-org-zotero-open (path _)
    (call-process "xdg-open" nil nil nil (concat "zotero:" path)))

  (org-link-set-parameters "zotero" :follow 'my-org-zotero-open)
#+end_src

#+RESULTS:
| :follow | my-org-zotero-open |

**** Org-pomodoro
:LOGBOOK:
CLOCK: [2024-11-01 Пт 14:28]--[2024-11-01 Пт 14:58] =>  0:30
:END:
The Pomodoro Technique is a time management technique that uses a timer to break
work into short intervals (typically 25 minutes of work followed by 5 minutes of
rest).

See https://todoist.com/productivity-methods/pomodoro-technique
See a simple pomodoro timer in the web browser https://pomofocus.io/

Of course, we want to use Emacs and ~org-mode~.

#+begin_src emacs-lisp :lexical no
  ;;(frostyx/guix :install "alsa-utils")
    
  (use-package sound-wav
    :ensure t
    :demand t) ;; dep for org-pomodoro
#+end_src

#+RESULTS:

#+begin_src emacs-lisp :lexical no
  (use-package powershell
    :ensure t
    :demand t) ;; dep for org-pomodoro
#+end_src

#+RESULTS:

#+BEGIN_SRC emacs-lisp
  (use-package org-pomodoro
    :ensure t
  	:bind (("C-c k" . my/org-pomodoro))
  	:config
  	(setq org-pomodoro-audio-player (or (executable-find "aplay") (executable-find "afplay"))
          org-pomodoro-play-sounds t           ; Determines whether soudns are played or not
  				org-pomodoro-keep-killed-pomodoro-time t
  				org-pomodoro-format " %s"
  				org-pomodoro-short-break-format " Short Break %s"
  				org-pomodoro-long-break-format  " Long Break %s"
  				;; org-pomodoro-finished-sound-p t
          ;; org-pomodoro-start-sound "/home/vberezhnev/.emacs.d/sounds/bell.mp3"

          org-pomodoro-start-sound-p t         ; Determine whether to play a sound when a pomodoro started
          org-pomodoro-start-sound (expand-file-name "sounds/bell.wav" user-emacs-directory)
          org-pomodoro-length 40                ; The length of a pomodoro in minutes

          org-pomodoro-finished-sound-p t      ; Determines whether to play a sound when a pomodoro finished
          org-pomodoro-finished-sound (expand-file-name "sounds/bell.wav" user-emacs-directory)

          org-pomodoro-manual-break t          ; Whether the user needs to exit manually from a running pomodoro to enter a break
          org-pomodoro-overtime-sound-p t      ; Determines whether to play a sound when a pomodoro starts to run overtime
          org-pomodoro-overtime-sound (expand-file-name "sounds/bell.wav" user-emacs-directory)

  				org-pomodoro-length 40
  				org-pomodoro-short-break-length 5
  				org-pomodoro-long-break-length 15
  				org-pomodoro-long-break-frequency 3
  				;;org-pomodoro-expiry-time 30
          ;;org-pomodoro-clock-break t           ; Whether to clock time during breaks
  				))

  (defun my/org-clock-get-clock-string ()
    (concat " " org-clock-heading))

  (setq spaceline-org-clock-format-function 'my/org-clock-get-clock-string)

  ;; (set-face-attribute 'org-pomodoro-mode-line nil :foreground my/green)
  ;; (set-face-attribute 'org-pomodoro-mode-line-overtime nil :foreground my/red)
#+END_SRC

#+RESULTS:
: my/org-clock-get-clock-string

If something goes wrong, you can test the sounds with

#+BEGIN_SRC example
  (org-pomodoro-play-sound :start)
#+END_SRC

#+RESULTS:
: #s(deferred #[257 "r\211q\210\300 )\301!\210\207" [buffer-string kill-buffer] 4 "
: 
: (fn BUF)"] deferred:default-errorback #[257 "\302\300\242!\210\302\301!\207" [(#0) #s(deferred deferred:default-callback deferred:default-errorback deferred:default-cancel #0 nil nil) deferred:default-cancel] 3 "
: 
: (fn X)"] nil nil nil)

Ah, chills.

#+BEGIN_SRC example
  ;; (setq org-pomodoro-short-break-sound-p nil)
  ;; (setq org-pomodoro-long-break-sound-p nil)

  (setq org-pomodoro-length 40)
  (setq org-pomodoro-short-break-length 5)
  (setq org-pomodoro-long-break-length 15)
  (setq org-pomodoro-long-break-frequency 3)
  (setq org-pomodoro-expiry-time 30)
#+END_SRC

#+RESULTS:
: 30

#+BEGIN_SRC emacs-lisp
(defun my/org-pomodoro ()
  (interactive)
  (org-pomodoro '(4)))
#+END_SRC

#+RESULTS:
: my/org-pomodoro

**** Prettify symbols
#+begin_src emacs-lisp :lexical no
  ;; ────────────────────────────── Prettify Symbols ─────────────────────────────
  ;; Beautify Org Checkbox Symbol
  (defun ma/org-buffer-setup ()
    "Something for like document, i guess 😕."
    (push '("[ ]" . "☐" ) prettify-symbols-alist)
    (push '("[X]" . "☑" ) prettify-symbols-alist)
    (push '("[-]" . "❍" ) prettify-symbols-alist))

  (setq prettify-symbols-unprettify-at-point 'right-edge)

  (add-hook 'org-mode-hook 'ma/org-buffer-setup)
  (add-hook 'org-mode-hook 'prettify-symbols-mode)
#+end_src

#+RESULTS:
| prettify-symbols-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-appear-mode | toc-org-mode | org-modern-mode | org-tempo-setup | ma/org-buffer-setup | (lambda nil (set (make-local-variable 'company-backends) '(company-org-block)) (company-mode 1)) | olivetti-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load |

*** LSP UI
#+BEGIN_SRC emacs-lisp
  (use-package lsp-ui
    :ensure t
    :hook (lsp-mode . lsp-ui-mode)
    :commands lsp-ui-mode
    :config
    (setq
     lsp-inlay-hints-mode t
     lsp-ui-doc-enable t
     lsp-ui-doc-max-height 8
     lsp-ui-doc-max-width 130         ; 150 (default) is too wide
     lsp-ui-doc-delay 0.1           ; 0.2 (default) is too naggy
     lsp-ui-doc-show-with-mouse t  ; don't disappear on mouseover
     ;; lsp-ui-doc-show-with-cursor t
     lsp-ui-doc-border (face-foreground 'default)
     lsp-ui-doc-position 'at-point
     lsp-ui-doc-include-signature t
     lsp-ui-doc-header t))

#+END_SRC

#+RESULTS:
| lsp-ui-mode | lsp-enable-which-key-integration |

